feat: new diagrams
